app/controllers/books_controller.rb

SELECT * FROM `books`
---
  def index
    @books = Book.all

SELECT * FROM `books` WHERE (`books`.`id` = 1)
---
  def show
    @book = Book.find(params[:id])

SELECT * FROM `books` WHERE (`books`.`id` = 1)
---
  def edit
    @book = Book.find(params[:id])

INSERT INTO `books` (`name`, `category`, `updated_at`, `description`, `sort_id`, `user_id`, `is_open`, `created_at`) VALUES('inRuby', '编程', '2009-11-29 04:13:31', '三联单放松', NULL, 9, 1, '2009-11-29 04:13:31')
---
  def create
    @book = Book.new(params[:book])
    @book.user = self.current_user

    respond_to do |format|
      if @book.save

SELECT * FROM `books` WHERE (`books`.`id` = 4)
UPDATE `books` SET `description` = 'Ruby,...阿我feew', `updated_at` = '2009-11-29 07:59:08' WHERE `id` = 4
---
  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])

SELECT * FROM `books` WHERE (`books`.`id` = 2)
DELETE FROM `books` WHERE `id` = 2
---
  def destroy
    @book = Book.find(params[:id])
    @book.destroy