app/controllers/chapters_controller.rb

SELECT * FROM `books` WHERE (`books`.`id` = 3)
---
  def load_book
    @book = Book.find(params[:book_id])

SELECT * FROM `chapters` WHERE (`chapters`.`id` = 1 AND (`chapters`.book_id = 3))
---
  def show
    @chapter = @book.chapters.find(params[:id])

SELECT * FROM `chapters` WHERE (`chapters`.`id` = 1 AND (`chapters`.book_id = 3))
---
  def edit
    @chapter = @book.chapters.find(params[:id])

INSERT INTO `chapters` (`updated_at`, `title`, `body`, `sort_id`, `continue_chapter_id`, `book_id`, `is_continue`, `created_at`) VALUES('2009-11-29 07:26:15', '第一章: 简介', '这是第一章!\r\n\r\na大赛分\r\n', NULL, NULL, 3, NULL, '2009-11-29 07:26:15')
---
  def create
    @chapter = @book.chapters.new(params[:chapter])

    respond_to do |format|
      if @chapter.save

SELECT * FROM `chapters` WHERE (`chapters`.`id` = 1 AND (`chapters`.book_id = 3))
UPDATE `chapters` SET `body` = '这是第一章!\r\n\r\na大赛分\r\n色繁荣we', `is_continue` = 0, `updated_at` = '2009-11-29 07:39:39' WHERE `id` = 1
---
  def update
    @chapter = @book.chapters.find(params[:id])

    respond_to do |format|
      if @chapter.update_attributes(params[:chapter])