app/controllers/gnotes_controller.rb

SELECT * FROM `gnotes`
---
  def index
    @gnotes = Gnote.all

SELECT * FROM `gnotes` WHERE (`gnotes`.`id` = 1)
---
  def show
    @gnote = Gnote.find(params[:id])

INSERT INTO `gnotes` (`name`, `message`, `updated_at`, `mail`, `site`, `created_at`) VALUES('ken', 'sdfw', '2009-11-28 14:27:24', 'kenrome@gmail.com', 'http://www', '2009-11-28 14:27:24')
---
  def create
    @gnote = Gnote.new(params[:gnote])

    respond_to do |format|
      if @gnote.save