app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])

    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `activation_code`, `remember_token`, `login`, `email`, `created_at`) VALUES('', '12128b6b74f4b7653a2d0f8dab45ddd4629bb2a1', '2009-11-28 13:02:57', NULL, '4f1816674961525bea13838414d66d78b5de6602', NULL, '078f9064d4a6252d7bbd7b1d7e84a0a24b242bad', NULL, 'ken', 'kenrome@gmail.com', '2009-11-28 13:02:57')